app/controllers/projects_controller.rb

  def remove_user
    authorize Project
    params[:user_ids].each do |user_id|
      if user_id != ""
        user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]