app/controllers/projects_controller.rb

  def create
    @project = current_user.projects.create(project_params)
---
INSERT INTO "projects" ("title", "created_at", "updated_at", "manager") VALUES (?, ?, ?, ?)  [["title", "test2"], ["created_at", "2021-08-13 10:39:28.697125"], ["updated_at", "2021-08-13 10:39:28.697125"], ["manager", "hanan"]]

  def add_user
     @developer= User.developers.not_yet_added(@project.id)
     @qa= User.qas.not_yet_added(@project.id)
    if params[:user_id].present?

      @project.project_users.create(user_id: params[:user_id])
---
INSERT INTO "project_users" ("project_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["project_id", 7], ["user_id", 3], ["created_at", "2021-08-13 11:08:13.604028"], ["updated_at", "2021-08-13 11:08:13.604028"]]

  def remove_user

    projectu = @project.project_users.find_by(user_id: params[:user_id])
    puts projectu
    projectu.destroy
---
SELECT "project_users".* FROM "project_users" WHERE "project_users"."project_id" = ? AND "project_users"."user_id" = ? LIMIT ?  [["project_id", 2], ["user_id", 3], ["LIMIT", 1]]
DELETE FROM "project_users" WHERE "project_users"."id" = ?  [["id", 7]]

  def create_bug
    if params.has_key?("commit")
      puts "--------------------------------------"
      @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]