app/models/user.rb

  scope :not_yet_added, ->(id) { select{|u| !u.projects.pluck(:id).include?(id)} }
---
SELECT "projects"."id" FROM "projects" INNER JOIN "project_users" ON "projects"."id" = "project_users"."project_id" WHERE "project_users"."user_id" = ?  [["user_id", 1]]